 // Это комментарий на одной строк
/*
Этот комментарий может писаться
не нескольких строчках
/*

/*
Тип данных
Number (число)
5
-100
2.276
Опереторы для работы с Number(бинарные)
+ оператор сложения
- опертаор вычитания
* оператор умножения
/ оператор деления
** возведение в степень (2**4 => 16)
% остаток от деления(100%3 => 1)
Унарные:
+
-
*/
console.log((-5+40)*10)

/* less 2
*/

let x
x=7
let y=x**2;

let a2=2



const PI=3,14;
//  PI=9.8;
/*
main page images
mainpageimages
main_page_images => snake case
mainPageImages => camel case
*/
let age=31;
age=age+1;
age = 1;
y += x;
/*
Операторы
+=
-=
*=
/=
%=
**=
*/





y**=(1/2);
console.log(y);
/* a += 1;
a++; инкремент => a = a+1
a--; декремент => a = a-1
*/
let n = 10;
let s = "10";
console.log(n + s);
